{
    "title": {
        "en": "Tech Lead Android",
        "fr": "Tech Lead Android"
    },
    "company": "STELLANTIS",
    "location": "France (Remote/Hybrid)",
    "period": {
        "en": "July 2022 – June 2025",
        "fr": "Juillet 2022 – Juin 2025"
    },
    "description": {
        "en": "Manage, support and develop the new 'Space' customer application.",
        "fr": "Piloter, assister et développer la nouvelle application client « Space »"
    },
    "achievements": {
        "en": [
            "Responsible for the Android development of the Space application, the Framework SDK, and the Middleware SDK.",
            "Designed and implemented a scalable Middleware SDK dedicated to offline vehicle services.",
            "Designed and implemented a Framework SDK dedicated to graphic components shared by various group applications.",
            "Define with the design team the structure of the tokens generated by Figma.",
            "Implement a modular, feature-based architecture based on the principles of Clean Architecture and MVVM.",
            "Maintained code coverage, with unit tests, above 85%."
        ],
        "fr": [
            "Responsable du développement Android de l’application Space, le SDK « Framework » et le SDK « middleware ».",
            "Conception et implémentation d’un SDK « middleware » évolutive dédié aux services de véhicule non connecté.",
            "Conception et implémentation d’un SDK « Framework » dédié aux composants graphiques partagé par différentes applications.",
            "Définir avec l’équipe de design la structure des tokens générer par Figma.",
            "Mise en place d’une architecture modulaire basée sur les features selon les principes de la Clean Architecture et du MVVM.",
            "Maintien d’une couverture de code, avec des tests unitaires, supérieure à 85 %."
        ]
    },
    "technologies": [
        "Kotlin",
        "Jetpack Compose",
        "Coroutines",
        "Flow",
        "Ktor",
        "Koin",
        "Room",
        "Clean Architecture",
        "MVVM",
        "CI/CD",
        "Sonar",
        "Detekt",
        "Figma",
        "StyleDictionary"
    ]
}